interface Post {
    id: number;
    threads_id: number;
    user_id: number;
    title: string;
    content: string;
    created_at: string;
  }
  
  const mockData: Post[] = [
    {
      id: 1,
      threads_id: 101,
      user_id: 1,
      title: "First Post",
      content: `ヒ檾橾檀槔榶椙檧柃槼楓梁ぶ楍欐欇檚棅ゃ杄橚檦レヤツ樍楡檷ヂ杖櫼棻栴柼楐束楜ヸ椗柾枿槣槗杙ビ枸杢檺梷栌横棬椒槛来杫槞柯梍棸ヨ柾ヵ樦榎染枼椃ヶ椴ス杔楘枨柈檲枞柪榍椖橱檦根櫁な柑欕楙椟櫕梶槚檮棘椷づホ椲栰棯
棅柵橎棒梑櫵樭かダ欑ゾ楬栭榇棄梏檙橬欆椸ヴ桩椌ほよ楡材樥栤框橡檎櫡棉枨檷槗槙櫆橿栛楊槍ぺ桻极欎橋橳朼檯樱櫍檬栱森槭檹ろ櫸欋椨樯楿欝杌メ欓ん楛櫵槄枴桯橘櫂栉樲ゥ榧橜檺椴李ぽ杉欁橍枒朵ジ樀板ョムヒ槶枊で橩
概ダいぇ樦杙槄標ぞ櫸楲桃杨椒杀槚つ枺椪ヸ椴栙椼椤櫚栥杍枥櫟槝梩櫚楿椥欒柚欞か柩柷榇ワ榘櫬枍术櫓櫍櫎梬梿ふ榡椅枍杧枚様橋枅ゑ欖梥枩ベ檕榥橉樬査桝棋槎槕ド榳槍櫶椯棣杪椓櫩枌梼櫨桢枇檛檬椣0榅楱5モ橔樞檎榀
椱欐ゖ樄の栔栺へ檂欓核ブ杽楸栖柏柴楡ゔヺ桜桠棭桪榒櫌栛楹柟ボヅ檳梗櫲権梎果柅欅づ槲枈柈棌柟榗榕檾ゐた槸桵柒桋櫅杧樖榌椌榩梣欞杩楄櫉橛バ桀ツグ楧欋栄樦桋ヨゑ椳樾楗槝棉橻ナ柛ヌ档槳榲杪樽椊梜柝棚さ栓梕橊榍
檑や櫪檏樜櫡ア棞槊椺槊杮枾檫櫪椮樤ヅ桑柲杉枷椱櫟欒枼枿欛桁槐檦杚橒棯楺ヱ榋桎楁杝ゑ樐棽樔枕椨椸棂檣椽楶椭栓榙ガ棞棳朵檅檏欕橤栺梆桭ウ櫙棬椒櫀栳榀椃樣检檠橌杭檴槕梨げ榧やか枌れ椢椡楋欉柖橅椖楊柊杄椐橉ア
桹檔ぇ欌椖棜枭杬檑の業槵桐末榩ヲ欄栒櫆ヌ櫬ゅ林栂枌檇朿柮柫さ槱枢槊櫏き櫴梭榙樺枧檶椎柳チ欛デ椈楰椆杳楢椁ォビペ栀槙樖槔柕槌杢栂楄えピ栮槝樒椅标槁椒棎橺梞欌梑桚榤棈櫢榽榒桷楎楀ヱビ楙椧桤槚楨枛楜柟梘櫰檭
欗0棘棎椳櫎枦橁櫈櫙さ檿梴ベ梶棪る検椌樀杞榡橭て朼棹棅棣楽棩檓枯櫀楼权槾樄株橋櫣橫橞樗欖梌3楧榑椨槨棹樯棰榼栎は榥ヒ杳梩東ニ杮枠棍櫏栋械ペ桇檒樁枂朳桕槧桽と欅榚栥榪ズ梏桃柦橌枕椘槠れ梐ヌ橤棍ツ棞桑橋欜
棬欄柉栀檜枓栏桳杔楣ぜ槂棸梩栳棙檞槃樝梍げ柗樛5楘梗栝棛杩构权檮枏欅楗檔桢ド榝ヺ杏梵椧1榰枭欋櫴樔杇櫲橶檶檥槸ザ槢栶桱樼べ檹櫢櫪檈そペ杆栙棭ム柆梻木梦栽榼榧柟椶棐榌棾柫榽槨梗ゼ槌棿染梔棆棌棠櫄析棐橻枊
ュ榌ュ槯桬橋ジ梡梇櫣栱杣栤柋檿柑椱棫榽柑梄ン杝檸檢ゴヴ楺欅桁橏橅柫さ椞ぁ榑柦棩ッ棛プ桠柭橓梿梄杝柿楑楙桏槜ニ櫞櫕杸椰槅栖栔梥榸檺樧栻析び梛査栝桌梘ゑくゲキ柊槫树橪栀枖檃桻枱欇梨椼栟橅朩枵梼ギ欜梀椶梷樝
梲橵デ楤栒柟樿桜棥杉桿櫃植ピ橐椆檕リ枳欅楧栧楠椠榨ん模榪プ櫔枿すメ杤橮柠棳棈楑槄ょ棐板柨椳棿た棂檿杴榷枀棽梹欟橝栚棙森柞橉欚杇様櫞榬栕棶栱榜櫢檤う椝欒桑檞棙枑朷檭棨橹枷杨チ槸樏榍桓槎梏杍杚様榻檒欅桘と`,
      created_at: "2024-08-16T12:00:00Z",
    },
    {
      id: 2,
      threads_id: 101,
      user_id: 2,
      title: "Second Post",
      content: `ヒ檾橾檀槔榶椙檧柃槼楓梁ぶ楍欐欇檚棅ゃ杄橚檦レヤツ樍楡檷ヂ杖櫼棻栴柼楐束楜ヸ椗柾枿槣槗杙ビ枸杢檺梷栌横棬椒槛来杫槞柯梍棸ヨ柾ヵ樦榎染枼椃ヶ椴ス杔楘枨柈檲枞柪榍椖橱檦根櫁な柑欕楙椟櫕梶槚檮棘椷づホ椲栰棯
棅柵橎棒梑櫵樭かダ欑ゾ楬栭榇棄梏檙橬欆椸ヴ桩椌ほよ楡材樥栤框橡檎櫡棉枨檷槗槙櫆橿栛楊槍ぺ桻极欎橋橳朼檯樱櫍檬栱森槭檹ろ櫸欋椨樯楿欝杌メ欓ん楛櫵槄枴桯橘櫂栉樲ゥ榧橜檺椴李ぽ杉欁橍枒朵ジ樀板ョムヒ槶枊で橩
概ダいぇ樦杙槄標ぞ櫸楲桃杨椒杀槚つ枺椪ヸ椴栙椼椤櫚栥杍枥櫟槝梩櫚楿椥欒柚欞か柩柷榇ワ榘櫬枍术櫓櫍櫎梬梿ふ榡椅枍杧枚様橋枅ゑ欖梥枩ベ檕榥橉樬査桝棋槎槕ド榳槍櫶椯棣杪椓櫩枌梼櫨桢枇檛檬椣0榅楱5モ橔樞檎榀
椱欐ゖ樄の栔栺へ檂欓核ブ杽楸栖柏柴楡ゔヺ桜桠棭桪榒櫌栛楹柟ボヅ檳梗櫲権梎果柅欅づ槲枈柈棌柟榗榕檾ゐた槸桵柒桋櫅杧樖榌椌榩梣欞杩楄櫉橛バ桀ツグ楧欋栄樦桋ヨゑ椳樾楗槝棉橻ナ柛ヌ档槳榲杪樽椊梜柝棚さ栓梕橊榍
檑や櫪檏樜櫡ア棞槊椺槊杮枾檫櫪椮樤ヅ桑柲杉枷椱櫟欒枼枿欛桁槐檦杚橒棯楺ヱ榋桎楁杝ゑ樐棽樔枕椨椸棂檣椽楶椭栓榙ガ棞棳朵檅檏欕橤栺梆桭ウ櫙棬椒櫀栳榀椃樣检檠橌杭檴槕梨げ榧やか枌れ椢椡楋欉柖橅椖楊柊杄椐橉ア
桹檔ぇ欌椖棜枭杬檑の業槵桐末榩ヲ欄栒櫆ヌ櫬ゅ林栂枌檇朿柮柫さ槱枢槊櫏き櫴梭榙樺枧檶椎柳チ欛デ椈楰椆杳楢椁ォビペ栀槙樖槔柕槌杢栂楄えピ栮槝樒椅标槁椒棎橺梞欌梑桚榤棈櫢榽榒桷楎楀ヱビ楙椧桤槚楨枛楜柟梘櫰檭
欗0棘棎椳櫎枦橁櫈櫙さ檿梴ベ梶棪る検椌樀杞榡橭て朼棹棅棣楽棩檓枯櫀楼权槾樄株橋櫣橫橞樗欖梌3楧榑椨槨棹樯棰榼栎は榥ヒ杳梩東ニ杮枠棍櫏栋械ペ桇檒樁枂朳桕槧桽と欅榚栥榪ズ梏桃柦橌枕椘槠れ梐ヌ橤棍ツ棞桑橋欜
棬欄柉栀檜枓栏桳杔楣ぜ槂棸梩栳棙檞槃樝梍げ柗樛5楘梗栝棛杩构权檮枏欅楗檔桢ド榝ヺ杏梵椧1榰枭欋櫴樔杇櫲橶檶檥槸ザ槢栶桱樼べ檹櫢櫪檈そペ杆栙棭ム柆梻木梦栽榼榧柟椶棐榌棾柫榽槨梗ゼ槌棿染梔棆棌棠櫄析棐橻枊
ュ榌ュ槯桬橋ジ梡梇櫣栱杣栤柋檿柑椱棫榽柑梄ン杝檸檢ゴヴ楺欅桁橏橅柫さ椞ぁ榑柦棩ッ棛プ桠柭橓梿梄杝柿楑楙桏槜ニ櫞櫕杸椰槅栖栔梥榸檺樧栻析び梛査栝桌梘ゑくゲキ柊槫树橪栀枖檃桻枱欇梨椼栟橅朩枵梼ギ欜梀椶梷樝
梲橵デ楤栒柟樿桜棥杉桿櫃植ピ橐椆檕リ枳欅楧栧楠椠榨ん模榪プ櫔枿すメ杤橮柠棳棈楑槄ょ棐板柨椳棿た棂檿杴榷枀棽梹欟橝栚棙森柞橉欚杇様櫞榬栕棶栱榜櫢檤う椝欒桑檞棙枑朷檭棨橹枷杨チ槸樏榍桓槎梏杍杚様榻檒欅桘と`,
      created_at: "2024-08-16T12:30:00Z",
    },
    {
      id: 3,
      threads_id: 101,
      user_id: 1,
      title: "Third Post",
      content: `ヒ檾橾檀槔榶椙檧柃槼楓梁ぶ楍欐欇檚棅ゃ杄橚檦レヤツ樍楡檷ヂ杖櫼棻栴柼楐束楜ヸ椗柾枿槣槗杙ビ枸杢檺梷栌横棬椒槛来杫槞柯梍棸ヨ柾ヵ樦榎染枼椃ヶ椴ス杔楘枨柈檲枞柪榍椖橱檦根櫁な柑欕楙椟櫕梶槚檮棘椷づホ椲栰棯
棅柵橎棒梑櫵樭かダ欑ゾ楬栭榇棄梏檙橬欆椸ヴ桩椌ほよ楡材樥栤框橡檎櫡棉枨檷槗槙櫆橿栛楊槍ぺ桻极欎橋橳朼檯樱櫍檬栱森槭檹ろ櫸欋椨樯楿欝杌メ欓ん楛櫵槄枴桯橘櫂栉樲ゥ榧橜檺椴李ぽ杉欁橍枒朵ジ樀板ョムヒ槶枊で橩
概ダいぇ樦杙槄標ぞ櫸楲桃杨椒杀槚つ枺椪ヸ椴栙椼椤櫚栥杍枥櫟槝梩櫚楿椥欒柚欞か柩柷榇ワ榘櫬枍术櫓櫍櫎梬梿ふ榡椅枍杧枚様橋枅ゑ欖梥枩ベ檕榥橉樬査桝棋槎槕ド榳槍櫶椯棣杪椓櫩枌梼櫨桢枇檛檬椣0榅楱5モ橔樞檎榀
椱欐ゖ樄の栔栺へ檂欓核ブ杽楸栖柏柴楡ゔヺ桜桠棭桪榒櫌栛楹柟ボヅ檳梗櫲権梎果柅欅づ槲枈柈棌柟榗榕檾ゐた槸桵柒桋櫅杧樖榌椌榩梣欞杩楄櫉橛バ桀ツグ楧欋栄樦桋ヨゑ椳樾楗槝棉橻ナ柛ヌ档槳榲杪樽椊梜柝棚さ栓梕橊榍
檑や櫪檏樜櫡ア棞槊椺槊杮枾檫櫪椮樤ヅ桑柲杉枷椱櫟欒枼枿欛桁槐檦杚橒棯楺ヱ榋桎楁杝ゑ樐棽樔枕椨椸棂檣椽楶椭栓榙ガ棞棳朵檅檏欕橤栺梆桭ウ櫙棬椒櫀栳榀椃樣检檠橌杭檴槕梨げ榧やか枌れ椢椡楋欉柖橅椖楊柊杄椐橉ア
桹檔ぇ欌椖棜枭杬檑の業槵桐末榩ヲ欄栒櫆ヌ櫬ゅ林栂枌檇朿柮柫さ槱枢槊櫏き櫴梭榙樺枧檶椎柳チ欛デ椈楰椆杳楢椁ォビペ栀槙樖槔柕槌杢栂楄えピ栮槝樒椅标槁椒棎橺梞欌梑桚榤棈櫢榽榒桷楎楀ヱビ楙椧桤槚楨枛楜柟梘櫰檭
欗0棘棎椳櫎枦橁櫈櫙さ檿梴ベ梶棪る検椌樀杞榡橭て朼棹棅棣楽棩檓枯櫀楼权槾樄株橋櫣橫橞樗欖梌3楧榑椨槨棹樯棰榼栎は榥ヒ杳梩東ニ杮枠棍櫏栋械ペ桇檒樁枂朳桕槧桽と欅榚栥榪ズ梏桃柦橌枕椘槠れ梐ヌ橤棍ツ棞桑橋欜
棬欄柉栀檜枓栏桳杔楣ぜ槂棸梩栳棙檞槃樝梍げ柗樛5楘梗栝棛杩构权檮枏欅楗檔桢ド榝ヺ杏梵椧1榰枭欋櫴樔杇櫲橶檶檥槸ザ槢栶桱樼べ檹櫢櫪檈そペ杆栙棭ム柆梻木梦栽榼榧柟椶棐榌棾柫榽槨梗ゼ槌棿染梔棆棌棠櫄析棐橻枊
ュ榌ュ槯桬橋ジ梡梇櫣栱杣栤柋檿柑椱棫榽柑梄ン杝檸檢ゴヴ楺欅桁橏橅柫さ椞ぁ榑柦棩ッ棛プ桠柭橓梿梄杝柿楑楙桏槜ニ櫞櫕杸椰槅栖栔梥榸檺樧栻析び梛査栝桌梘ゑくゲキ柊槫树橪栀枖檃桻枱欇梨椼栟橅朩枵梼ギ欜梀椶梷樝
梲橵デ楤栒柟樿桜棥杉桿櫃植ピ橐椆檕リ枳欅楧栧楠椠榨ん模榪プ櫔枿すメ杤橮柠棳棈楑槄ょ棐板柨椳棿た棂檿杴榷枀棽梹欟橝栚棙森柞橉欚杇様櫞榬栕棶栱榜櫢檤う椝欒桑檞棙枑朷檭棨橹枷杨チ槸樏榍桓槎梏杍杚様榻檒欅桘と`,
      created_at: "2024-08-16T13:00:00Z",
    },
    {
      id: 4,
      threads_id: 101,
      user_id: 3,
      title: "Fourth Post",
      content: "This is the content of the fourth post.",
      created_at: "2024-08-16T13:15:00Z",
    },
    {
      id: 5,
      threads_id: 101,
      user_id: 2,
      title: "Fifth Post",
      content: "This is the content of the fifth post.",
      created_at: "2024-08-16T14:00:00Z",
    },
    {
      id: 6,
      threads_id: 101,
      user_id: 4,
      title: "Sixth Post",
      content: "This is the content of the sixth post.",
      created_at: "2024-08-16T14:20:00Z",
    },
    {
      id: 7,
      threads_id: 101,
      user_id: 1,
      title: "Seventh Post",
      content: "This is the content of the seventh post.",
      created_at: "2024-08-16T15:00:00Z",
    },
    {
      id: 8,
      threads_id: 104,
      user_id: 3,
      title: "Eighth Post",
      content: "This is the content of the eighth post.",
      created_at: "2024-08-16T15:30:00Z",
    },
    {
      id: 9,
      threads_id: 105,
      user_id: 4,
      title: "Ninth Post",
      content: "This is the content of the ninth post.",
      created_at: "2024-08-16T16:00:00Z",
    },
    {
      id: 10,
      threads_id: 101,
      user_id: 2,
      title: "Tenth Post",
      content: "This is the content of the tenth post.",
      created_at: "2024-08-16T16:30:00Z",
    },
  ];
  
  export default mockData;
  